###################################################################

# Created by write_sdc on Fri Dec 18 00:05:53 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {PC_OUT[31]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[30]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[29]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[28]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[27]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[26]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[25]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[24]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[23]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[22]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[21]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[20]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[19]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[18]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[17]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[16]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[15]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[14]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[13]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[12]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[11]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[10]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[9]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[8]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[7]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[6]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[5]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[4]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[3]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[2]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[1]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[0]}]
set_load -pin_load 3.40189 [get_ports MemWrite]
set_load -pin_load 3.40189 [get_ports MemRead]
set_load -pin_load 3.40189 [get_ports {mem_address[31]}]
set_load -pin_load 3.40189 [get_ports {mem_address[30]}]
set_load -pin_load 3.40189 [get_ports {mem_address[29]}]
set_load -pin_load 3.40189 [get_ports {mem_address[28]}]
set_load -pin_load 3.40189 [get_ports {mem_address[27]}]
set_load -pin_load 3.40189 [get_ports {mem_address[26]}]
set_load -pin_load 3.40189 [get_ports {mem_address[25]}]
set_load -pin_load 3.40189 [get_ports {mem_address[24]}]
set_load -pin_load 3.40189 [get_ports {mem_address[23]}]
set_load -pin_load 3.40189 [get_ports {mem_address[22]}]
set_load -pin_load 3.40189 [get_ports {mem_address[21]}]
set_load -pin_load 3.40189 [get_ports {mem_address[20]}]
set_load -pin_load 3.40189 [get_ports {mem_address[19]}]
set_load -pin_load 3.40189 [get_ports {mem_address[18]}]
set_load -pin_load 3.40189 [get_ports {mem_address[17]}]
set_load -pin_load 3.40189 [get_ports {mem_address[16]}]
set_load -pin_load 3.40189 [get_ports {mem_address[15]}]
set_load -pin_load 3.40189 [get_ports {mem_address[14]}]
set_load -pin_load 3.40189 [get_ports {mem_address[13]}]
set_load -pin_load 3.40189 [get_ports {mem_address[12]}]
set_load -pin_load 3.40189 [get_ports {mem_address[11]}]
set_load -pin_load 3.40189 [get_ports {mem_address[10]}]
set_load -pin_load 3.40189 [get_ports {mem_address[9]}]
set_load -pin_load 3.40189 [get_ports {mem_address[8]}]
set_load -pin_load 3.40189 [get_ports {mem_address[7]}]
set_load -pin_load 3.40189 [get_ports {mem_address[6]}]
set_load -pin_load 3.40189 [get_ports {mem_address[5]}]
set_load -pin_load 3.40189 [get_ports {mem_address[4]}]
set_load -pin_load 3.40189 [get_ports {mem_address[3]}]
set_load -pin_load 3.40189 [get_ports {mem_address[2]}]
set_load -pin_load 3.40189 [get_ports {mem_address[1]}]
set_load -pin_load 3.40189 [get_ports {mem_address[0]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[31]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[30]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[29]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[28]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[27]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[26]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[25]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[24]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[23]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[22]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[21]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[20]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[19]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[18]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[17]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[16]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[15]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[14]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[13]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[12]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[11]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[10]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[9]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[8]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[7]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[6]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[5]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[4]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[3]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[2]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[1]}]
set_load -pin_load 3.40189 [get_ports {data_to_write[0]}]
set_load -pin_load 3.40189 [get_ports {RF_address[4]}]
set_load -pin_load 3.40189 [get_ports {RF_address[3]}]
set_load -pin_load 3.40189 [get_ports {RF_address[2]}]
set_load -pin_load 3.40189 [get_ports {RF_address[1]}]
set_load -pin_load 3.40189 [get_ports {RF_address[0]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[31]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[30]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[29]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[28]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[27]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[26]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[25]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[24]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[23]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[22]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[21]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[20]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[19]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[18]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[17]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[16]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[15]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[14]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[13]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[12]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[11]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[10]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[9]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[8]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[7]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[6]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[5]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[4]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[3]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[2]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[1]}]
set_load -pin_load 3.40189 [get_ports {RF_data_in[0]}]
set_load -pin_load 3.40189 [get_ports RegWrite]
create_clock [get_ports clk]  -name MY_CLK  -period 12.5  -waveform {0 6.25}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst_n]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_OUT[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MemWrite]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MemRead]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mem_address[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_to_write[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_address[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_address[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_address[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_address[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_address[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RF_data_in[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports RegWrite]
